Revit 2015 API
RebarRoundingManager Properties
The RebarRoundingManager type exposes the following members.
Properties
Name | Description
ApplicableReinforcementRoundingSource
 Identifies the source of the rounding settings for this element.
ApplicableSegmentLengthRounding
 The applicable rounding for shared parameters used by rebar.
ApplicableTotalLengthRounding
 The applicable rounding for Bar Length and Total Bar Length parameters.
Element
 The owner of the reinforcement rounding overrides.
 (Inherited from ReinforcementRoundingManager.)
IsActiveOnElement
 Defines whether reinforcement rounding is activated for the particular element.
 (Inherited from ReinforcementRoundingManager.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ReinforcementRoundingManager.)
LengthDisplayUnit
 The length units used when displaying the reinforcement rounding values.
 (Inherited from ReinforcementRoundingManager.)
SegmentLengthRounding
 The rounding for shared parameters used by rebar.
TotalLengthRounding
 The rounding for Bar Length and Total Bar Length parameters.
See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace